tutorials/PFB_2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name    p1;
        type    cellSet;
        action  new;  //add,delete,subset,clear,invert,remove
        source  boxToCell;
        sourceInfo
        {
            box (-0.24 -0.4 0.46) (-0.15  0.4  0.64);
        }
    }
    {
        name    p2;
        type    cellSet;
        action  new;  //add,delete,subset,clear,invert,remove
        source  boxToCell;
        sourceInfo
        {
            box (-0.15 -0.4 0.55) ( 0.15  0.4  0.64);
        }
    }
        {
        name    p3;
        type    cellSet;
        action  new;  //add,delete,subset,clear,invert,remove
        source  boxToCell;
        sourceInfo
        {
            box ( 0.15 -0.4 0.46) (0.24  0.4  0.64);
        }
    }

///////////////////
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.15 -0.4 0.57) (-0.15  -0.4  0.57);
        }
    }
    
     
   {
        name    c2;
        type    cellSet;
        action  add;//,delete,subset,clear,invert,remove
        source   cellToCell;
        sourceInfo
        {
            set     p1;
        }
    }
       {
        name    c2;
        type    cellSet;
        action  add;//,delete,subset,clear,invert,remove
        source   cellToCell;
        sourceInfo
        {
            set     p2;
        }
    }
       {
        name    c2;
        type    cellSet;
        action  add;//,delete,subset,clear,invert,remove
        source   cellToCell;
        sourceInfo
        {
            set     p3;
        }
    }
     

    {
        name    porous;
        type    cellZoneSet;
        action  new;  //add,delete,subset,clear,invert,remove
        source  setToCellZone;
        sourceInfo
        {
        set     c2;
        }
    } 
);

// ************************************************************************* //
